Solodros/ChibiOS-Contrib/.history/os/common/ext/CMSIS/AT32/AT32F413xx/at32f413xx_20230424215952.h
/******************  Bit definition for IOMUX_REMAP3 register  ************/
#define IOMUX_REMAP3_TMR9_GMUX              (0xFU << 0)
#define IOMUX_REMAP3_TMR9_GMUX_NOREMAP      (0x0U << 0)     /*!< TMR9 CH1/PA2 CH2/PA3 */
#define IOMUX_REMAP3_TMR9_GMUX_FULLREMAP    (0x2U << 0)     /*!< TMR9 CH1/PB14 CH2/PB15 */
#define IOMUX_REMAP3_TMR10_GMUX             (0xFU << 4)
#define IOMUX_REMAP3_TMR10_GMUX_NOREMAP     (0x0U << 4)     /*!< TMR10 CH1/PB8 */
#define IOMUX_REMAP3_TMR10_GMUX_FULLREMAP   (0x2U << 4)     /*!< TMR10 CH1/PA6 */
#define IOMUX_REMAP3_TMR11_GMUX             (0xFU << 8)
#define IOMUX_REMAP3_TMR11_GMUX_NOREMAP     (0x0U << 8)     /*!< TMR11 CH1/PB9 */
#define IOMUX_REMAP3_TMR11_GMUX_FULLREMAP   (0x2U << 8)     /*!< TMR11 CH1/PA7 */

/******************  Bit definition for IOMUX_REMAP4 register  ************/
#define IOMUX_REMAP4_TMR5_GMUX              (0x7U << 16)
#define IOMUX_REMAP4_TMR5_GMUX_NOREMAP      (0x0U << 16)    /*!< TMR5 CH1/PA0 CH2/PA1 */
#define IOMUX_REMAP4_TMR5_GMUX_FULLREMAP    (0x1U << 16)    /*!< TMR5 CH1/PF4 CH2/PF5 */

/******************  Bit definition for IOMUX_REMAP5 register  ************/
#define IOMUX_REMAP5_I2C1_GMUX               (0xFU << 4)
#define IOMUX_REMAP5_I2C1_GMUX_NOREMAP       (0x0U << 4)    /*!< SCL/PB6,SDA/PB7 SMBA/PB5 */
#define IOMUX_REMAP5_I2C1_GMUX_PARTIALREMAP  (0x1U << 4)    /*!< SCL/PB8,SDA/PB9 SMBA/PB5 */
#define IOMUX_REMAP5_I2C1_GMUX_FULLREMAP     (0x3U << 4)    /*!< SCL/PF6,SDA/PF7 SMBA/PB5 */
#define IOMUX_REMAP5_I2C2_GMUX               (0xFU << 8)
#define IOMUX_REMAP5_I2C2_GMUX_NOREMAP       (0x0U << 8)    /*!< SCL/PB10,SDA/PB11 SMBA/PB12 */
#define IOMUX_REMAP5_I2C2_GMUX_PARTIALREMAP1 (0x1U << 8)    /*!< SCL/PF6,SDA/PF7 SMBA/PA9 */
#define IOMUX_REMAP5_I2C2_GMUX_PARTIALREMAP2 (0x2U << 8)    /*!< SCL/PA8,SDA/PC9 SMBA/PA9 */
#define IOMUX_REMAP5_I2C2_GMUX_FULLREMAP     (0x3U << 8)    /*!< SCL/PA8,SDA/PB4 SMBA/PA9 */
#define IOMUX_REMAP5_SPI1_GMUX               (0xFU << 16)
#define IOMUX_REMAP5_SPI1_GMUX_NOREMAP       (0x0U << 16)   /*!< CS/PA4,SCK/PA5,MISO/PA6,MOSI/PA7,MCK/PB0 */
#define IOMUX_REMAP5_SPI1_GMUX_FULLREMAP     (0x1U << 16)   /*!< CS/PA15,SCK/PB3,MISO/PB4,MOSI/PB5,MCK/PB6 */
#define IOMUX_REMAP5_SPI2_GMUX               (0xFU << 20)
#define IOMUX_REMAP5_SPI2_GMUX_NOREMAP       (0x0U << 20)   /*!< CS/PB12,SCK/PB13,MISO/PB14,MOSI/PB15,MCK/PB0 */
#define IOMUX_REMAP5_SPI2_GMUX_FULLREMAP     (0x1U << 20)   /*!< CS/PA15,SCK/PB3,MISO/PB4,MOSI/PB5,MCK/PC7 */

/******************  Bit definition for USBFS_CTRL register  **************/
#define USBFS_CTRL_GRESUME               (0x1U << 4)

/******************  Bit definition for DEBUG_CTRL register  **************/
#define DEBUG_CTRL_SLEEP                 (0x1U << 0)
#define DEBUG_CTRL_DEEPSLEEP             (0x1U << 1)
#define DEBUG_CTRL_STANDBY               (0x1U << 2)
#define DEBUG_CTRL_TRACE_IOEN            (0x1U << 5)
#define DEBUG_CTRL_TRACE_MODE            (0x3U << 6)
#define DEBUG_CTRL_WDT_PAUSE             (0x1U << 8)
#define DEBUG_CTRL_WWDT_PAUSE            (0x1U << 9)
#define DEBUG_CTRL_TMR1_PAUSE            (0x1U << 10)
#define DEBUG_CTRL_TMR2_PAUSE            (0x1U << 11)
#define DEBUG_CTRL_TMR3_PAUSE            (0x1U << 12)
#define DEBUG_CTRL_TMR4_PAUSE            (0x1U << 13)
#define DEBUG_CTRL_CAN1_PAUSE            (0x1U << 14)
#define DEBUG_CTRL_I2C1_SMBUS_TIMEOUT    (0x1U << 15)
#define DEBUG_CTRL_I2C2_SMBUS_TIMEOUT    (0x1U << 16)
#define DEBUG_CTRL_TMR8_PAUSE            (0x1U << 17)
#define DEBUG_CTRL_TMR5_PAUSE            (0x1U << 18)
#define DEBUG_CTRL_CAN2_PAUSE            (0x1U << 21)
#define DEBUG_CTRL_TMR9_PAUSE            (0x1U << 28)
#define DEBUG_CTRL_TMR10_PAUSE           (0x1U << 29)
#define DEBUG_CTRL_TMR11_PAUSE           (0x1U << 30)

/** @addtogroup Peripheral_memory_map
  * @{
  */

#define FLASH_BASE                       ((uint32_t)0x08000000)
#define SPIM_FLASH_BASE                  ((uint32_t)0x08400000)
#define USD_BASE                         ((uint32_t)0x1FFFF800)
#define SRAM_BASE                        ((uint32_t)0x20000000)
#define PERIPH_BASE                      ((uint32_t)0x40000000)
#define XMC_REG_BASE                     ((uint32_t)0xA0000000)
#define DEBUG_BASE                       ((uint32_t)0xE0042000)

#define APB1PERIPH_BASE                  (PERIPH_BASE + 0x00000)
#define APB2PERIPH_BASE                  (PERIPH_BASE + 0x10000)
#define AHBPERIPH_BASE                   (PERIPH_BASE + 0x20000)

/* apb1 bus base address */
#define TMR2_BASE                        (APB1PERIPH_BASE + 0x0000)
#define TMR3_BASE                        (APB1PERIPH_BASE + 0x0400)
#define TMR4_BASE                        (APB1PERIPH_BASE + 0x0800)
#define TMR5_BASE                        (APB1PERIPH_BASE + 0x0C00)
#define RTC_BASE                         (APB1PERIPH_BASE + 0x2800)
#define WWDT_BASE                        (APB1PERIPH_BASE + 0x2C00)
#define WDT_BASE                         (APB1PERIPH_BASE + 0x3000)
#define SPI2_BASE                        (APB1PERIPH_BASE + 0x3800)
#define USART2_BASE                      (APB1PERIPH_BASE + 0x4400)
#define USART3_BASE                      (APB1PERIPH_BASE + 0x4800)
#define UART4_BASE                       (APB1PERIPH_BASE + 0x4C00)
#define UART5_BASE                       (APB1PERIPH_BASE + 0x5000)
#define I2C1_BASE                        (APB1PERIPH_BASE + 0x5400)
#define I2C2_BASE                        (APB1PERIPH_BASE + 0x5800)
#define USBFS_BASE                       (APB1PERIPH_BASE + 0x5C00)
#define CAN1_BASE                        (APB1PERIPH_BASE + 0x6400)
#define CAN2_BASE                        (APB1PERIPH_BASE + 0x6800)
#define BPR_BASE                         (APB1PERIPH_BASE + 0x6C00)
#define PWC_BASE                         (APB1PERIPH_BASE + 0x7000)
/* apb2 bus base address */
#define IOMUX_BASE                       (APB2PERIPH_BASE + 0x0000)
#define EXINT_BASE                       (APB2PERIPH_BASE + 0x0400)
#define GPIOA_BASE                       (APB2PERIPH_BASE + 0x0800)
#define GPIOB_BASE                       (APB2PERIPH_BASE + 0x0C00)
#define GPIOC_BASE                       (APB2PERIPH_BASE + 0x1000)
#define GPIOD_BASE                       (APB2PERIPH_BASE + 0x1400)
#define GPIOF_BASE                       (APB2PERIPH_BASE + 0x1C00)
#define ADC1_BASE                        (APB2PERIPH_BASE + 0x2400)
#define ADC2_BASE                        (APB2PERIPH_BASE + 0x2800)
#define TMR1_BASE                        (APB2PERIPH_BASE + 0x2C00)
#define SPI1_BASE                        (APB2PERIPH_BASE + 0x3000)
#define TMR8_BASE                        (APB2PERIPH_BASE + 0x3400)
#define USART1_BASE                      (APB2PERIPH_BASE + 0x3800)
#define TMR9_BASE                        (APB2PERIPH_BASE + 0x4C00)
#define TMR10_BASE                       (APB2PERIPH_BASE + 0x5000)
#define TMR11_BASE                       (APB2PERIPH_BASE + 0x5400)
#define ACC_BASE                         (APB2PERIPH_BASE + 0x5800)
#define SDIO1_BASE                       (APB2PERIPH_BASE + 0x8000)
/* ahb bus base address */
#define DMA1_BASE                        (AHBPERIPH_BASE + 0x0000)
#define DMA1_CHANNEL1_BASE               (AHBPERIPH_BASE + 0x0008)
#define DMA1_CHANNEL2_BASE               (AHBPERIPH_BASE + 0x001C)
#define DMA1_CHANNEL3_BASE               (AHBPERIPH_BASE + 0x0030)
#define DMA1_CHANNEL4_BASE               (AHBPERIPH_BASE + 0x0044)
#define DMA1_CHANNEL5_BASE               (AHBPERIPH_BASE + 0x0058)
#define DMA1_CHANNEL6_BASE               (AHBPERIPH_BASE + 0x006C)
#define DMA1_CHANNEL7_BASE               (AHBPERIPH_BASE + 0x0080)
#define DMA2_BASE                        (AHBPERIPH_BASE + 0x0400)
#define DMA2_CHANNEL1_BASE               (AHBPERIPH_BASE + 0x0408)
#define DMA2_CHANNEL2_BASE               (AHBPERIPH_BASE + 0x041C)
#define DMA2_CHANNEL3_BASE               (AHBPERIPH_BASE + 0x0430)
#define DMA2_CHANNEL4_BASE               (AHBPERIPH_BASE + 0x0444)
#define DMA2_CHANNEL5_BASE               (AHBPERIPH_BASE + 0x0458)
#define DMA2_CHANNEL6_BASE               (AHBPERIPH_BASE + 0x046C)
#define DMA2_CHANNEL7_BASE               (AHBPERIPH_BASE + 0x0480)
#define CRM_BASE                         (AHBPERIPH_BASE + 0x1000)
#define FLASH_REG_BASE                   (AHBPERIPH_BASE + 0x2000)
#define CRC_BASE                         (AHBPERIPH_BASE + 0x3000)

#define FLASHSIZE_BASE                   ((uint32_t)0x1FFFF7E0U)    /*!< FLASH Size register base address */
#define UID_BASE                         ((uint32_t)0x1FFFF7E8U)    /*!< Unique device ID register base address */
/**
  * @}
  */

/**
  * @brief type define exint register all
  */
typedef struct
{

  /**
    * @brief exint inten register, offset:0x00
    */
  __IO uint32_t INTEN;

  /**
    * @brief exint evten register, offset:0x04
    */
  __IO uint32_t EVTEN;

  /**
    * @brief exint polcfg1 register, offset:0x08
    */
  __IO uint32_t POLCFG1;

  /**
    * @brief exint polcfg2 register, offset:0x0C
    */
  __IO uint32_t POLCFG2;

  /**
    * @brief exint swtrg register, offset:0x10
    */
  __IO uint32_t SWTRG;

  /**
    * @brief exint intsts register, offset:0x14
    */
  __IO uint32_t INTSTS;

} EXINT_TypeDef;

/**
  * @brief type define crm register all
  */
typedef struct
{
  /**
    * @brief crm ctrl register, offset:0x00
    */
  __IO uint32_t CTRL;

  /**
    * @brief crm cfg register, offset:0x04
    */
  __IO uint32_t CFG;

  /**
    * @brief crm clkint register, offset:0x08
    */
  __IO uint32_t CLKINT;

  /**
    * @brief crm apb2rst register, offset:0x0C
    */
  __IO uint32_t APB2RST;
  
  /**
    * @brief crm apb1rst register, offset:0x10
    */
  __IO uint32_t APB1RST;
    
  /**
    * @brief crm ahben register, offset:0x14
    */
  __IO uint32_t AHBEN;

  /**
    * @brief crm apb2en register, offset:0x18
    */
  __IO uint32_t APB2EN;

  /**
    * @brief crm apb1en register, offset:0x1C
    */
  __IO uint32_t APB1EN;
  
  /**
    * @brief crm bpdc register, offset:0x20
    */
  __IO uint32_t BPDC;
  
  /**
    * @brief crm ctrlsts register, offset:0x24
    */
  __IO uint32_t CTRLSTS;

  /**
    * @brief crm reserved1 register, offset:0x28~0x2C
    */
  __IO uint32_t RESERVED1[2];

  /**
    * @brief crm misc1 register, offset:0x30
    */
  __IO uint32_t MISC1;

  /**
    * @brief crm reserved2 register, offset:0x4C~0x34
    */
  __IO uint32_t RESERVED2[7];

  /**
    * @brief crm misc2 register, offset:0x50
    */
  __IO uint32_t MISC2;

  /**
    * @brief crm misc3 register, offset:0x54
    */
  __IO uint32_t MISC3;

  /**
    * @brief crm reserved3 register, offset:0x58
    */
  __IO uint32_t RESERVED3;

  /**
    * @brief crm intmap register, offset:0x5C
    */
  __IO uint32_t INTMAP;

} CRM_TypeDef;


/**
  * @brief type define pwc register all
  */
typedef struct
{
  /**
    * @brief pwc ctrl register, offset:0x00
    */
  __IO uint32_t CTRL;

  /**
    * @brief pwc ctrlsts register, offset:0x04
    */
  __IO uint32_t CTRLSTS;

} PWC_TypeDef;

/**
  * @brief type define flash register all
  */
typedef struct
{
  /**
    * @brief flash psr register, offset:0x00
    */
  __IO uint32_t PSR;

  /**
    * @brief flash unlock register, offset:0x04
    */
  __IO uint32_t UNLOCK;

  /**
    * @brief flash usd unlock register, offset:0x08
    */
  __IO uint32_t USD_UNLOCK;

  /**
    * @brief flash sts register, offset:0x0C
    */
  __IO uint32_t STS;

  /**
    * @brief flash ctrl register, offset:0x10
    */
  __IO uint32_t CTRL;

  /**
    * @brief flash addr register, offset:0x14
    */
  __IO uint32_t ADDR;

  /**
    * @brief flash reserved1 register, offset:0x18
    */
  __IO uint32_t RESERVED1;

  /**
    * @brief flash usd register, offset:0x1C
    */
  __IO uint32_t USD;

  /**
    * @brief flash epps register, offset:0x20
    */
  __IO uint32_t EPPS;

  /**
    * @brief flash reserved2 register, offset:0x80~0x24
    */
  __IO uint32_t RESERVED2[24];

  /**
    * @brief flash unlock3 register, offset:0x84
    */
  __IO uint32_t UNLOCK3;

  /**
    * @brief flash select register, offset:0x88
    */
  __IO uint32_t SELECT;

  /**
    * @brief flash sts3 register, offset:0x8C
    */
  __IO uint32_t STS3;

  /**
    * @brief flash ctrl3 register, offset:0x90
    */
  __IO uint32_t CTRL3;

  /**
    * @brief flash addr3 register, offset:0x94
    */
  __IO uint32_t ADDR3;

  /**
    * @brief flash da register, offset:0x98
    */
  __IO uint32_t DA;

  /**
    * @brief flash reserved5 register, offset:0xC8~0x9C
    */
  __IO uint32_t RESERVED5[12];

  /**
    * @brief flash slib_sts0 register, offset:0xCC
    */
  __IO uint32_t SLIB_STS0;

  /**
    * @brief flash slib_sts1 register, offset:0xD0
    */
  __IO uint32_t SLIB_STS1;

  /**
    * @brief flash slib_pwd_clr register, offset:0xD4
    */
  __IO uint32_t SLIB_PWD_CLR;

  /**
    * @brief flash slib_misc_sts register, offset:0xD8
    */
  __IO uint32_t SLIB_MISC_STS;

  /**
    * @brief flash slib_set_pwd register, offset:0xDC
    */
  __IO uint32_t SLIB_SET_PWD;

  /**
    * @brief flash slib_set_range register, offset:0xE0
    */
  __IO uint32_t SLIB_SET_RANGE;

  /**
    * @brief flash reserved6 register, offset:0xEC~0xE4
    */
  __IO uint32_t RESERVED6[3];

  /**
    * @brief flash slib_unlock register, offset:0xF0
    */
  __IO uint32_t SLIB_UNLOCK;

  /**
    * @brief flash crc_ctrl register, offset:0xF4
    */
  __IO uint32_t CRC_CTRL;

  /**
    * @brief flash crc_chkr register, offset:0xF8
    */
  __IO uint32_t CRC_CHKR;

} FLASH_TypeDef;

/**
  * @brief type define bpr register all
  */
typedef struct
{
  /**
    * @brief reserved, offset:0x00
    */
  __IO uint32_t RESERVED1;

  /**
    * @brief bpr dt1 register, offset:0x04
    */
  __IO uint32_t DT1[10];

  /**
    * @brief bpr rtccal register, offset:0x2C
    */
  __IO uint32_t RTCCAL;

  /**
    * @brief bpr ctrl register, offset:0x30
    */
  __IO uint32_t CTRL;

  /**
    * @brief bpr ctrlsts register, offset:0x34
    */
  __IO uint32_t CTRLSTS;

  /**
    * @brief reserved, offset:0x38
    */
  __IO uint32_t RESERVED2;

  /**
    * @brief reserved, offset:0x3C
    */
  __IO uint32_t RESERVED3;

  /**
    * @brief bpr dt11-42 register, offset:0x40
    */
  __IO uint32_t DT2[32];

} BPR_TypeDef;

/**
  * @brief type define gpio register all
  */
typedef struct
{
  /**
    * @brief gpio cfglr register, offset:0x00
    */
  __IO uint32_t CFGLR;

  /**
    * @brief gpio cfghr register, offset:0x04
    */
  __IO uint32_t CFGHR;

  /**
    * @brief gpio idt register, offset:0x08
    */
  __IO uint32_t IDT;

  /**
    * @brief gpio odt register, offset:0x0C
    */
  __IO uint32_t ODT;

  /**
    * @brief gpio scr register, offset:0x10
    */
  __IO uint32_t SCR;

  /**
    * @brief gpio clr register, offset:0x14
    */
  __IO uint32_t CLR;
  /**
    * @brief gpio wpr register, offset:0x18
    */
  __IO uint32_t WPR;

